content-org/posts.org
#+hugo_base_dir: ../
#+hugo_level_offset: 1
#+seq_todo: TODO DONE
#+startup: indent
#+hugo_weight: auto
#+hugo_auto_set_lastmod: t
#+hugo_paired_shortcodes: admonition
#+hugo_front_matter_key_replace: description>featuredImage
#+author:
#+hugo_custom_front_matter: :author "Matt Maguire"
#+filetags: @Blog

*** DONE Migrating Blog from Wordpress to Org Mode :Emacs:OrgMode:Lingvoj:Esperanto:Ŝava:
:PROPERTIES:
:EXPORT_FILE_NAME: index.eo.md
:EXPORT_HUGO_BUNDLE: 20241226_org-mode-blog
:EXPORT_DATE: 2024-12-26
:EXPORT_HUGO_MENU:
:END:

Lastatempe mi uzis sufiĉe ofte Org-reĝimon kun Emacs por pli bone organizi ĉe oficejo kaj spuri kunvenojn. La venonta logika paŝo estis migrigi mian blogon el Wordpress kaj integri ĝin en mian Org-reĝiman laborfluon.

La profitoj estas:
- ne plu devi gastisi kaj subteni Wordpress-an instancon ĉe mia hejma komputilo, kun la sekurecaj riskoj kiujn tio kunportas.
- statika retejo gastigita ĉe GitHub ĝenerale ŝarĝas pli rapide kaj ne dependas de konsumanta grado de interreta alliĝo kiu malfunkcias de tempo al tempo.
- pro tio ke mi jam uzadas Emacs/Org-reĝimon en mia ĉiutaga laboro, estas oportuna havi unuigitan formaton por ĉiuj miaj notoj, ĉu personaj aŭ ĉu por eldonado.

Pro tio ke okazas la kristnaska ferio, mi havas la tempon esplori la diversajn eblecojn, kaj mi alvenis al uzi ox-hugo-n por eksporti miajn Org-reĝimajn blogafiŝojn kaj dokumentojn al Hugo retejo bazite je la ''KeepIt'' retejtemo. Tiu temo posedas utilajn funkciojn kiel subteno de $\KaTeX$ por aperigi matematikajn ekvaciojn, kaj multlingva subteno por verki artikolojn per aliaj lingvoj/alfabetoj (kiel Esperanto aŭ la Ŝava alfabeto).

Mi nun atingis la tempopunkton kiam mi kredas ke mi povas malstarigi la Wordpress-an retejon, do ni vidu kiel mi faros!

Se vi volas ion por ridetigi vin, spektu la suban videon pri la ĉiel utila Emacs:

#+hugo: {{< youtube urcL86UpqZc >}}

