content/posts/20241226_org-mode-blog/index.eo.md
+++
title = "Migrating Blog from Wordpress to Org Mode"
date = 2024-12-26
lastmod = 2025-03-02T17:23:31+11:00
tags = ["Emacs", "OrgMode", "Esperanto", "Shavian"]
categories = ["Blog"]
draft = false
weight = 3003
author = "Matt Maguire"
+++

Lastatempe mi uzis sufiĉe ofte Org-reĝimon kun Emacs por pli bone organizi ĉe oficejo kaj spuri kunvenojn. La venonta logika paŝo estis migrigi mian blogon el Wordpress kaj integri ĝin en mian Org-reĝiman laborfluon.

La profitoj estas:

-   ne plu devi gastisi kaj subteni Wordpress-an instancon ĉe mia hejma komputilo, kun la sekurecaj riskoj kiujn tio kunportas.
-   statika retejo gastigita ĉe GitHub ĝenerale ŝarĝas pli rapide kaj ne dependas de konsumanta grado de interreta alliĝo kiu malfunkcias de tempo al tempo.
-   pro tio ke mi jam uzadas Emacs/Org-reĝimon en mia ĉiutaga laboro, estas oportuna havi unuigitan formaton por ĉiuj miaj notoj, ĉu personaj aŭ ĉu por eldonado.

Pro tio ke okazas la kristnaska ferio, mi havas la tempon esplori la diversajn eblecojn, kaj mi alvenis al uzi ox-hugo-n por eksporti miajn Org-reĝimajn blogafiŝojn kaj dokumentojn al Hugo retejo bazite je la ''KeepIt'' retejtemo. Tiu temo posedas utilajn funkciojn kiel subteno de \\(\KaTeX\\) por aperigi matematikajn ekvaciojn, kaj multlingva subteno por verki artikolojn per aliaj lingvoj/alfabetoj (kiel Esperanto aŭ la Ŝava alfabeto).

Mi nun atingis la tempopunkton kiam mi kredas ke mi povas malstarigi la Wordpress-an retejon, do ni vidu kiel mi faros!

Se vi volas ion por ridetigi vin, spektu la suban videon pri la ĉiel utila Emacs:

{{< youtube urcL86UpqZc >}}
